{
  "secciones": {
    "perfil": "Perfil",
    "proyectos": "Proyectos",
    "educacion": "Educación",
    "idiomas": "Idiomas",
    "certificados": "Certificados"
  },
  "language": {
    "bandera": "twemoji:flag-colombia",
    "lengua": "Español"
  },
  "ubicacion": "Sincelejo, Colombia",
  "email": "ruizdeider09@gmail.com",
  "telefono": "+57 3003096996",
  "links": {
    "linkedin": "https://www.linkedin.com/in/deiderruiz/",
    "github": "https://github.com/DeiderRuiz"
  },
  "resumen": "Full Stack Developer con enfoque en UX/UI. Trabajo en el desarrollo de productos web end-to-end para pequeñas empresas y proyectos en crecimiento, priorizando usabilidad, claridad y objetivos reales del usuario. Combino desarrollo y diseño web para convertir ideas en soluciones funcionales e intuitivas.",
  "secciones_habilidades": {
    "destacadas": "Habilidades destacadas",
    "habilidades": "Habilidades",
    "curriculum": "Ver hoja de vida"
  },
  "roles": [
    {
      "titulo": "Full Stack Developer",
      "descripcion": "Especializado en el desarrollo aplicaciones web end-to-end y APIs REST. He trabajado en productos reales construidos desde cero, definiendo arquitectura, flujos de datos y automatización de procesos. Trabajo principalmente con Laravel, Vue.js, Angular y MySQL, realizando despliegues en AWS y estructurando aplicaciones con foco en mantenibilidad, claridad del código y escalabilidad progresiva. Me siento cómodo abordando proyectos pequeños y medianos, adaptando la complejidad técnica según las necesidades reales del producto.",
      "habilidades": [
        "JavaScript",
        "TypeScript",
        "PHP",
        "Python",
        "Laravel",
        "Vue.js",
        "Angular",
        "Flask",
        "Tailwind CSS",
        "Bootstrap",
        "MySQL",
        "APIs REST",
        "Despliegue en la Nube",
        "AWS",
        "Git",
        "Análisis de Requisitos",
        "Testing Funcional"
      ],
      "curriculum": "/pdfs/Deider_Ruiz_Desarrollador_Full_Stack.pdf"
    },
    {
      "titulo": "UX/UI Designer",
      "descripcion": "Especializado en el diseño interfaces claras e intuitivas para productos digitales. Trabajo el diseño como parte del proceso de construcción del producto, definiendo flujos, jerarquías visuales y prototipos interactivos en Figma para validar la experiencia antes del desarrollo. Mi experiencia colaborando directamente con desarrollo me permite crear diseños viables, accesibles y coherentes, asegurando que lo definido en diseño se traduzca fielmente en la implementación final sin perder usabilidad ni intención visual.",
      "habilidades": [
        "Figma",
        "HTML",
        "CSS",
        "Diseño Centrado en el Usuario",
        "Lean UX",
        "Design Thinking",
        "Atomic Design",
        "Diseño Responsivo",
        "Accesibilidad Web"
      ],
      "curriculum": "/pdfs/Deider_Ruiz_Disenador_UX_UI.pdf"
    }
  ],
  "seccion_proyectos": {
    "developer": "Objetivos alcanzados como Full Stack Developer",
    "designer": "Objetivos alcanzados como UX/UI Designer",
    "github": "Ver repositorio en GitHub",
    "figma": "Ver maquetado en Figma",
    "carousel": "Ver imagenes de",
    "ver_mas": "Click para ver más"
  },
  "proyectos": [
    {
      "id": 3,
      "logo": "/images/RSL.png",
      "titulo": "RS Lodgings",
      "fecha_inicio": "Enero 2024",
      "fecha_fin": "Mayo 2025",
      "rol": "Full Stack Developer & UX/UI Designer",
      "descripcion": "RS Lodgings es una aplicación web para la reserva de habitaciones y la gestión de servicios hoteleros, orientada a pequeños negocios que buscan centralizar la administración de habitaciones, ofertas y reservas de forma eficiente.",
      "stack": ["Laravel", "Vue.js", "MySQL", "Tailwind CSS"],
      "github": "https://github.com/DeiderRuiz/RS-Lodgings",
      "figma": "https://www.figma.com/proto/BxlQ5G2nne40TrVI2Z1roK/RS-Lodgings?page-id=0%3A1&node-id=1-3&p=f&viewport=93%2C260%2C0.07&t=vvN9IDJTHHtzaGbt-1&scaling=scale-down&content-scaling=fixed&starting-point-node-id=1%3A3",
      "color": "#BDAE81",
      "logros_dev": [
        "Automaticé procesos administrativos implementando lógica de negocio con Laravel, eliminando 7 tareas manuales y agilizando la operación.",
        "Optimicé consultas SQL para reducir la carga de datos, logrando una mejora de aproximadamente un 25% en los tiempos de ejecución.",
        "Desarrollé un cron job para la actualización diaria del estado de reservas y disponibilidad de habitaciones, automatizando el proceso y evitando tareas manuales repetitivas."
      ],
      "logros_designer": [
        "Estructuré la primera versión del producto enfocándola en el flujo crítico de reserva y pago, eliminando pasos innecesarios y asegurando una experiencia clara desde la selección hasta la confirmación.",
        "Definí la tipografía y paleta de colores bajo estándares de accesibilidad WCAG, logrando una UI con contraste óptimo y alta legibilidad, alineada con la identidad del negocio.",
        "Diseñé el prototipo interactivo en Figma definiendo flujos de navegación y jerarquías visuales que facilitaron la implementación del frontend y aceleraron la entrega del producto."
      ],
      "imagenes": [
        "/images/RSL_index.png",
        "/images/RSL_rooms.png",
        "/images/RSL_deals.png",
        "/images/RSL_cities.png"
      ]
    },
    {
      "id": 2,
      "logo": "/images/UAJS.png",
      "titulo": "Psicobot",
      "fecha_inicio": "Septiembre 2024",
      "fecha_fin": "Septiembre 2023",
      "rol": "Full Stack Developer & UX/UI Designer",
      "descripcion": "Psicobot es una aplicación web orientada a la gestión de citas de orientación psicológica, que integra un chatbot con inteligencia artificial como complemento al acompañamiento brindado por profesionales de la salud mental.",
      "stack": ["Flask", "Vue.js", "MySQL", "Tailwind CSS"],
      "github": "https://github.com/DeiderRuiz/Psicobot",
      "figma": "https://www.figma.com/proto/9W5MLOxmBSqaZliFmZwTdx/Psychobot?page-id=0%3A1&node-id=2215-29&p=f&viewport=-143%2C464%2C0.07&t=6q28pfW7JFtbh90A-1&scaling=scale-down&content-scaling=fixed",
      "color": "#50C878",
      "logros_dev": [
        "Desarrollé una interfaz responsiva con Vue.js y Tailwind CSS, obteniendo una calificación de usabilidad promedio de 4.6/5 en la escala Likert a través de encuestas a usuarios.",
        "Automaticé 3 procesos administrativos del servicio de salud mental al desarrollar la capa servidor en Flask, reemplazando formularios manuales por soluciones digitales.",
        "Integré un chatbot de apoyo psicológico para estudiantes mediante la implementación de la API externa de OpenAI, habilitando un módulo de interacción conversacional dentro del sistema.",
        "Diseñé de flujo conversacional del chatbot, obteniendo una confiabilidad psicométrica (α = 0.87) en impresión diagnóstica, validada con encuestas a usuarios.",
        "Lideré el despliegue de la aplicación en AWS (EC2, RDS) y validé su estabilidad mediante pruebas de carga con Apache JMeter, garantizando soporte para más de 500 usuarios simultáneos."
      ],
      "logros_designer": [
        "Conduje entrevistas con usuarios potenciales y colaboré con los stakeholders para redactar historias de usuario, lo cual permitió priorizar funciones clave y alinear la hoja de ruta con las necesidades del proyecto.",
        "Definí la paleta de colores aplicando psicología del color y el branding institucional, asegurando coherencia visual con la identidad y valores de la universidad y la intención comunicativa del producto.",
        "Diseñé un prototipo interactivo en Figma con una estructura minimalista y jerarquías visuales claras, facilitando la comprensión de los flujos y reduciendo fricción en la navegación."
      ],
      "imagenes": [
        "/images/Psico_index.png",
        "/images/Psico_chatbot.png",
        "/images/Psico_solicitar.png",
        "/images/Psico_citas.png"
      ]
    },
    {
      "id": 1,
      "logo": "/images/SH.png",
      "titulo": "SPEEDHUNTERS",
      "fecha_inicio": "Agosto 2021",
      "fecha_fin": "Junio 2022",
      "rol": "Full Stack Developer & UX/UI Designer",
      "descripcion": "SPEEDHUNTERS es una aplicación web de ventas de vehículos diseñado para digitalizar procesos comerciales de un concesionario de autos, permitiendo la solicitud de cotizaciones, opciones de financiación y la programación de test drives.",
      "stack": ["Laravel", "JavaScript", "MySQL", "Tailwind CSS"],
      "github": "https://github.com/DeiderRuiz/speedhunters",
      "figma": "https://www.figma.com/proto/zUGwTduvkoOsCMJ85jMs4r/SEEDHUNTERS-beta?page-id=0%3A1&node-id=2313-2&viewport=297%2C304%2C0.31&t=h4UEV76xjJeh5dfH-1&scaling=scale-down&content-scaling=fixed",
      "color": "#E51A4C",
      "logros_dev": [
        "Refactoricé y migré módulos clave de PHP puro a Laravel, reduciendo la deuda técnica y mejorando la mantenibilidad y seguridad del sistema.",
        "Automaticé procesos comerciales y administrativos mediante módulos backend en Laravel, eliminando 9 tareas manuales y aumentando la eficiencia operativa.",
        "Implementé un middleware para restringir acceso a rutas administrativas, eliminando accesos no autorizados y fortaleciendo la seguridad del sistema."
      ],
      "logros_designer": [
        "Definí una matriz de trazabilidad de requisitos funcionales para organizar y priorizar funcionalidades desde la etapa inicial, reduciendo ambigüedades y facilitando una base clara para el diseño y desarrollo del producto.",
        "Esquematicé wireframes que facilitaron la validación temprana del flujo de usuario, evitando retrabajos y mejorando la comunicación con el equipo de desarrollo.",
        "Diseñé un prototipo interactivo en Figma que sirvió como guía visual y funcional, agilizando decisiones de diseño y asegurando que la experiencia respondiera a los objetivos del producto."
      ],
      "imagenes": [
        "/images/SH_index.png",
        "/images/SH_autos.png",
        "/images/SH_cotizar.png",
        "/images/SH_td.png"
      ]
    }
  ],
  "educacion": {
    "grado": "Grado en ingeniería de sistemas",
    "universidad": "Corporación Universitaria Antonio José de Sucre",
    "inicio": "2018",
    "fin": "2025",
    "ciudad": "Sincelejo, Colombia"
  },
  "idiomas": [
    {
      "bandera": "twemoji:flag-colombia",
      "lengua": "Español",
      "nivel": "Nativo"
    },
    {
      "bandera": "twemoji:flag-for-flag-united-states",
      "lengua": "Inglés",
      "nivel": "B2"
    }
  ],
  "ver_certificado": "Ver certificado",
  "certificados": [
    {
      "titulo": "Taller Figma",
      "from": "Desafío Latam",
      "fecha": "Julio 2025",
      "link": "https://cursos.desafiolatam.com/certificates/qp8jsarqoc"
    },
    {
      "titulo": "Certificado de Ponente – IV Congreso Internacional de Ciencias Multidisciplinarias",
      "from": "Corporación Universitaria Antonio José de Sucre",
      "fecha": "Agosto 2024",
      "link": "https://drive.google.com/file/d/17vuFYBt3WIKOWspOYQuJVplx_Wf5c5dG/view?usp=sharing"
    },
    {
      "titulo": "Certificado en Investigación e Innovación – UAJS",
      "from": "Corporación Universitaria Antonio José de Sucre",
      "fecha": "Agosto 2024",
      "link": "https://drive.google.com/file/d/1nar5910WG8oUFTMDzklz1YHH-JZ713KY/view?usp=sharing"
    },
    {
      "titulo": "Certificación en SQL y Bases de Datos Relacionales",
      "from": "Cognitive Class - IBM",
      "fecha": "Mayo 2023",
      "link": "https://courses.cognitiveclass.ai/certificates/64645485a6ce4ad395198f3eab5ed775"
    },
    {
      "titulo": "English B2 Level",
      "from": "Centro de Idiomas Tweetalig – Cambridge University Press",
      "fecha": "Junio 2020",
      "link": "https://drive.google.com/file/d/1vbgPARxQWCp4Ox_CFoi_99kzGXyaIOFY/view?usp=sharing"
    }
  ],
  "footer": {
    "titulo": "Detrás del código",
    "disponibilidad": "Disponible Para:",
    "trabajos": ["Trabajo remoto", "Tiempo completo", "Tiempo parcial", "Freelancer"]
  },
  "aboutMe": [
    {
      "srcImage": "/images/KJ.jpg",
      "altImage": "Killjoy",
      "text": "Main Killjoy en Valorant"
    },
    {
      "srcImage": "/images/Scorpios.png",
      "altImage": "Scorpios Rocket League",
      "text": "Lider de Scorpios en Rocket League"
    },
    {
      "srcImage": "/images/junior.png",
      "altImage": "Junior",
      "text": "Hincha de Junior de Barranquilla"
    }
  ]
}
